---
kind: method
id: M:Autodesk.Revit.DB.BindingMap.Remove(Autodesk.Revit.DB.Definition)
zh: 删除、移除
source: html/37736c4d-f7ee-0223-82d8-f3103cf6be3f.htm
---
# Autodesk.Revit.DB.BindingMap.Remove Method

**中文**: 删除、移除

The Remove method is used to remove a parameter binding.

## Syntax (C#)
```csharp
public virtual bool Remove(
	Definition key
)
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`) - A parameter definition which can be an existing definition or one from a shared parameters file.